#!/usr/bin/python -tt

'''
OOP
Море относится к ... океану?								3
Оно примыкает к ... государству?							4
Большое?/Маленькое											6
Там обитают ...?											8
Морские границы...?											3
Средняя глубина больше 200м?								5
Средняя температура воды поверхности ...?					9
Гласная?													2
Соленость ...? Пресное?										10
Относительно России ..западнее..? 							11	
Цвет														7
Туристическое 												12
Военные испытания???????									13
Нефтедобыча													14
Морские пути 												15
Исторические факты											16
Первооткрыватель 											17
Порты 														18
Есть ли остров .... в море? 								19
Литосферные плиты 											20
Вулканы														21
Заливы														22
Реки
'''

print('Был запущен алгоритм фасетного поиска среди определенных 20 морей:\n \n Японское,Азовское, Балтийское, Красное, Аравийское, Белое, Баренцево, Лазарево, Росса, Черное, Охотское, Желтое, Мраморное, Чукотское, Дюрвиля, Норвежское, Карское, Эгейское, Карибское, Северное \n Вам будет задана серия вопросов, пожалуйста, дайте ответ в форме "Да","Нет" или "Не знаю"\n')

class Sea:
	def __init__(self,name,waterBorders, govBorders, depth, size, color, fauna, temperature, saltiness, position, attraction, warFactor,extraction,routes, facts, founder, ports, islands, litos,volcanos, gulfs, rivers):

		pass



